[
  {
    "slug" : "biography-method",
    "title" : "The Biography Method: Enhancing Social Interactions Through Curiosity",
    "datePublished" : "8/16/2024",
    "summary" : "It is often difficult to know how to connect with people. Navigating social interactions can be challenging. You can overcome this with the Biography Method, a way of interacting with others by imagining that you are getting ready to write their life story."
  },
  {
    "slug" : "weaving-baskets-and-better-essays",
    "title" : "Weaving Baskets and Better Essays",
    "datePublished" : "8/02/2024",
    "summary" : "In college, I created a method for writing cohesive essays more quickly. Learn how to organize your thoughts, assign colors to main ideas, and create cohesive, impactful papers. Discover how this colorful approach to writing, inspired by anthropology studies, can streamline your writing process and improve your academic performance."
  },
  {
    "slug" : "relative-sacrifice",
    "title" : "Relative Sacrifice",
    "datePublished" : "8/01/2024",
    "summary" : "You can improve your relationships with others by finding the relative weight of the sacrifices others make for you and respond accordingly."
  },
  {
    "slug" : "monk-week",
    "title" : "Monk Week - How Taking Exams Early Changed My Life",
    "datePublished" : "7/30/2024",
    "summary" : "You don't have to be successful to set aside time for deep reflection. Setting aside time to read, think, and plan makes you more successful."
  },
  {
    "slug" : "grow-your-focus",
    "title" : "Grow Your Focus",
    "datePublished" : "7/23/2024",
    "summary" : "It doesn't matter who you are. Lack of focus inhibits connection, productivity, and enjoyment. Too many people think that they can't focus. Trust me, you can."
  },
  {
    "slug" : "eliminate-automate-delegate-do",
    "title" : "Eliminate Automate Delegate Do",
    "datePublished" : "7/22/2024",
    "summary" : "When there are tasks that just need to be done, you can use this process to reduce the amount of unpleasant, mundane work you have on your plate."
  },
  {
    "slug" : "mastery",
    "title" : "Mastery",
    "datePublished" : "7/17/2024",
    "summary" : "No one is great at the start of something creative. Don't be afraid to pursue something challenging. Find something that engages you. Work to master it. That will bring you satisfaction."
  },
  {
    "slug" : "better-business-writing",
    "title" : "Better Business Writing",
    "datePublished" : "6/17/2024",
    "summary" : "Writing should be as easy to understand as possible. Make your work entertaining, but not at the expense of simplicity."
  },
  {
    "slug" : "books-that-have-changed-my-life",
    "title" : "Books That Have Changed My Life",
    "datePublished" : "6/15/2024",
    "summary" : "\"If you haven't read hundreds of books, you are functionally illiterate, and you will be incompetent, because your personal experiences alone aren't broad enough to sustain you.\" - Jim Mattis"
  }

]
